alsa-oss
alsa-utils
base
base-devel
bash-completion
blas-openblas
bluez
bluez-utils
btop
cellwriter
chrome-remote-desktop
clang
cmake
cockpit
cronie
ctop
cuda
discord-ptb
docker
docker-compose
dolphin
efibootmgr
eww
eza
fastfetch
firefox
font-manager
fzf
git
glow
grub
hyprland
hyprlang
hyprpaper
hyprshot
imagemagick
inxi
iotop
isync
jack2
jellycli
jellyfin-web
jre17-openjdk
kitty
krita
less
libspotify
linux
linux-firmware
liquidprompt
lsof
mako
mesa-utils
meson
mopidy
mopidy-iris
mopidy-local
mopidy-scrobbler
mpv
msmtp
nano
ncdu
ncspot
neofetch
neovim
networkmanager
nfs-utils
nodejs
npm
nvidia
nvidia-container-toolkit
nvidia-settings
otf-hermit
otf-hermit-nerd
otf-openmoji
pacman-contrib
pnpm
putty
pyenv
python-huggingface-hub
python-pip
python-pipx
python-requests
qbittorrent-nox
qt6-tools
reflector
remote-desktop-manager
ripcord
rsync
rustdesk-bin
rustup
samba
smartmontools
spotify-tui
sshfs
sshpass
swaylock-effects
tigervnc
tmux
ttf-anonymous-pro
ttf-font-awesome
ttf-jetbrains-mono-nerd
ttf-maple-beta
ttf-maple-beta-nf
ttf-maple-beta-nf-cn
ttf-space-mono-nerd
unzip
usbip
usbutils
uv
vulkan-validation-layers
wacom-settings-git
waybar
waynergy
wayvnc
wget
whisparr-nightly-bin
wireguard-tools
wl-clipboard
wlroots
wmctrl
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xf86-input-wacom
xfsprogs
xorg-xwayland
xorgxrdp-nvidia
xournalpp
xrdp
yarn
yay
yay-debug
