alsa-utils
arp-scan
barrier
base
base-devel
bash-completion
blueman
bluez
bluez-utils
brightnessctl
btop
cellwriter
chatgpt-desktop-bin
cifs-utils
cliphist
cmake
cockpit
cpupower
ctop
darktable
deskflow
docker
docker-compose
dolphin
dos2unix
dosfstools
dunst
efibootmgr
eza
falkon
feh
firefox
flameshot
font-manager
foot
fuse2
fzf
gammastep
gcc
geckodriver
gesture-manager-git
ghostty
git
glfw
glow
grafana
grim
grit
grub
gtk-vnc
gvim
httpie
hyprland
hyprland-qtutils
hyprlock
hyprpaper
hyprpicker
hyprshot-git
hyprsysteminfo
i2pd
imagemagick
inxi
isync
jellyfin-server
jellyfin-web
jq
kitty
krita
less
libinput-gestures
linux
linux-firmware
lsof
make
mako
mopidy
mosh
mpv
msmtp
nano
ncdu
ncspot-bin
neofetch
neovim
networkmanager
nfs-utils
ngrep
nmap
npm
openssh
openvpn
pamixer
paru-bin
patch
pavucontrol
pipewire
pipewire-alsa
pipewire-pulse
pkgconf
power-profiles-daemon
powertop
prometheus
putty
pyenv
qbittorrent-nox
qt5-wayland
qt5-webengine
qt6-wayland
remmina
ripcord
rofi
rofi-emoji
simplescreenrecorder
slurp
smbclient
socat
sqlitebrowser
sshfs
sshpass
sudo
sway
swaybg
swaylock-effects
swaync
tcpdump
termshark
ticker
tigervnc
timeshift
tk
tmux
tor
tor-browser-alpha-bin
torsocks
tree
ttf-cascadia-code
ttf-fira-code
ttf-font-awesome
ttf-ibmplex-mono-nerd
ttf-jetbrains-mono-nerd
ttf-maple-beta
ttf-maple-beta-nf
ttf-maple-beta-nf-cn
ttf-material-design-icons-webfont
ttf-roboto-mono
tumbler
unzip
upscayl-bin
usbip
vulkan-intel
wacom-settings-git
wacomtablet
wakeonlan
waybar
wayland-protocols
wayland-utils
waylock
waynergy
wayvnc
wget
wireguard-tools
wireless-regdb
wireplumber
wl-clipboard
wlroots
wmctrl
wtype
xclip
xdotool
xf86-input-wacom
xf86-video-intel
xorg-server
xournalpp
yay
yay-debug
ydotool
yetris
zram-generator
zsh

=== System Information (inxi -Fxz) ===

System:
  Kernel: 6.13.8-arch1-1 arch: x86_64 bits: 64 compiler: gcc v: 14.2.1
  Desktop: Hyprland v: 0.48.1 Distro: Arch Linux
Machine:
  Type: Laptop System: LENOVO product: 82V6 v: IdeaPad 1 14IGL7
    serial: <superuser required>
  Mobo: LENOVO model: LNVNB161216 v: SDK0T76477 WIN
    serial: <superuser required> UEFI: LENOVO v: KKCN23WW date: 03/29/2024
Battery:
  ID-1: BAT0 charge: 40.8 Wh (99.5%) condition: 41.0/42.0 Wh (97.6%)
    volts: 12.7 min: 11.2 model: Sunwoda L21D3PF0 status: not charging
CPU:
  Info: dual core model: Intel Celeron N4020 bits: 64 type: MCP
    arch: Goldmont Plus rev: 8 cache: L1: 112 KiB L2: 4 MiB
  Speed (MHz): avg: 1444 min/max: 800/2800 cores: 1: 1444 2: 1444
    bogomips: 4377
  Flags: ht lm nx pae sse sse2 sse3 sse4_1 sse4_2 ssse3 vmx
Graphics:
  Device-1: Intel GeminiLake [UHD Graphics 600] vendor: Lenovo driver: i915
    v: kernel arch: Gen-9.5 bus-ID: 00:02.0
  Device-2: IMC Networks Integrated Camera driver: uvcvideo type: USB
    bus-ID: 1-7:3
  Display: wayland server: X.org v: 1.21.1.16 with: Xwayland v: 24.1.6
    compositor: Hyprland v: 0.48.1 driver: gpu: i915
    resolution: no compositor data resolution: 1366x768
  API: EGL Message: EGL data requires eglinfo. Check --recommends.
  Info: Tools: wl: swaymsg,wayland-info x11: xprop
Audio:
  Device-1: Intel Celeron/Pentium Silver Processor High Definition Audio
    vendor: Lenovo driver: snd_hda_intel v: kernel bus-ID: 00:0e.0
  API: ALSA v: k6.13.8-arch1-1 status: kernel-api
  Server-1: sndiod v: N/A status: off
  Server-2: PipeWire v: 1.4.1 status: active
Network:
  Device-1: Realtek RTL8852BE PCIe 802.11ax Wireless Network vendor: Lenovo
    driver: rtw89_8852be v: kernel port: 1000 bus-ID: 03:00.0
  IF: wlp3s0 state: up mac: <filter>
  IF-ID-1: br-63615dd31ca3 state: down mac: <filter>
  IF-ID-2: br-a76143f9e7bd state: up speed: 10000 Mbps duplex: unknown
    mac: <filter>
  IF-ID-3: br-e76bed31d799 state: up speed: 10000 Mbps duplex: unknown
    mac: <filter>
  IF-ID-4: br-ed3f0d75a166 state: down mac: <filter>
  IF-ID-5: docker0 state: down mac: <filter>
  IF-ID-6: veth7748306 state: up speed: 10000 Mbps duplex: full
    mac: <filter>
  IF-ID-7: vethb1c359b state: up speed: 10000 Mbps duplex: full
    mac: <filter>
  IF-ID-8: vethe89ad19 state: up speed: 10000 Mbps duplex: full
    mac: <filter>
Bluetooth:
  Device-1: Realtek Bluetooth Radio driver: btusb v: 0.8 type: USB
    bus-ID: 1-3:2
  Report: btmgmt ID: hci0 rfk-id: 2 state: up address: <filter> bt-v: 5.2
    lmp-v: 11
Drives:
  Local Storage: total: 116.5 GiB used: 87.11 GiB (74.8%)
  ID-1: /dev/mmcblk1 model: MMC128 size: 116.5 GiB type: Removable
Partition:
  ID-1: / size: 113.62 GiB used: 86.95 GiB (76.5%) fs: ext4
    dev: /dev/mmcblk1p2
  ID-2: /boot size: 511 MiB used: 158 MiB (30.9%) fs: vfat
    dev: /dev/mmcblk1p1
Swap:
  ID-1: swap-1 type: file size: 2 GiB used: 637.8 MiB (31.1%) file: /swapfile
  ID-2: swap-2 type: zram size: 1.69 GiB used: 1.1 GiB (65.4%)
    dev: /dev/zram0
Sensors:
  System Temperatures: cpu: 37.0 C mobo: N/A
  Fan Speeds (rpm): N/A
Info:
  Memory: total: 4 GiB note: est. available: 3.38 GiB used: 2.53 GiB (74.9%)
  Processes: 253 Uptime: 4d 22h 16m Init: systemd
  Packages: 1020 Compilers: gcc: 14.2.1 Shell: system-info.sh inxi: 3.3.37

=== Memory Information (free -h) ===

               total        used        free      shared  buff/cache   available
Mem:           3.4Gi       2.5Gi       553Mi       404Mi       1.1Gi       877Mi
Swap:          3.7Gi       1.7Gi       2.0Gi

=== Disk Usage (df -h) ===

Filesystem                     Size  Used Avail Use% Mounted on
dev                            1.7G     0  1.7G   0% /dev
run                            1.7G  1.6M  1.7G   1% /run
efivarfs                        16E     0 -5.1K   0% /sys/firmware/efi/efivars
/dev/mmcblk1p2                 114G   87G   21G  81% /
tmpfs                          1.7G  528K  1.7G   1% /dev/shm
tmpfs                          1.7G  5.1M  1.7G   1% /tmp
/dev/mmcblk1p1                 511M  159M  353M  31% /boot
//192.168.1.68/Shared          111G  106G  4.7G  96% /home/braydenchaffee/mnt/windows-share
//192.168.1.68/Jellyfin        111G  106G  4.7G  96% /home/braydenchaffee/mnt/TempMedia
192.168.1.239:/mnt/netstorage   11T  282G   11T   3% /mnt/netstorage
tmpfs                          1.0M     0  1.0M   0% /run/credentials/getty@tty1.service
tmpfs                          347M  4.2M  343M   2% /run/user/1000
tmpfs                          1.0M     0  1.0M   0% /run/credentials/systemd-journald.service

=== Wayland Session Variables ===

WAYLAND_DISPLAY=wayland-1
MOZ_ENABLE_WAYLAND=1
